<a href="https://colab.research.google.com/github/guzik1234/DataScienceCwiczenia/blob/main/python_pandas/aplly.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(0)
s = pd.Series(np.random.randn(20))

In [4]:
minimum = s.aggregate('min')
minimum

-0.977277879876411

In [5]:
maximum = s.aggregate('max')
maximum

2.240893199201458

In [6]:
suma = s.aggregate('sum')
suma

np.float64(11.386691858912695)

In [7]:
mean = s.aggregate('mean')
mean

np.float64(0.5693345929456347)

In [8]:
std = s.aggregate('std')
std

0.8722691485249854

In [9]:
stats = s.aggregate(['min', 'max', 'sum', 'mean', 'std'])
stats

min     -0.977278
max      2.240893
sum     11.386692
mean     0.569335
std      0.872269
dtype: float64

In [10]:
np.random.seed(0)

In [12]:
#sigma = 10 , mean = 5
s = pd.Series(10 * np.random.randn(20) + 5)
s

0    -20.529898
1     11.536186
2     13.644362
3     -2.421650
4     27.697546
5     -9.543657
6      5.457585
7      3.128161
8     20.327792
9     19.693588
10     6.549474
11     8.781625
12    -3.877857
13   -14.807965
14     1.520879
15     6.563490
16    17.302907
17    17.023798
18     1.126732
19     1.976972
dtype: float64

In [14]:
a= s.apply(abs)
a

0     20.529898
1     11.536186
2     13.644362
3      2.421650
4     27.697546
5      9.543657
6      5.457585
7      3.128161
8     20.327792
9     19.693588
10     6.549474
11     8.781625
12     3.877857
13    14.807965
14     1.520879
15     6.563490
16    17.302907
17    17.023798
18     1.126732
19     1.976972
dtype: float64

In [15]:
#sprawdza czy tutaj posrod float sa zmienne typu intiger
a = s.apply(float.is_integer)
a

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [16]:
a = s.apply(int)
a

0    -20
1     11
2     13
3     -2
4     27
5     -9
6      5
7      3
8     20
9     19
10     6
11     8
12    -3
13   -14
14     1
15     6
16    17
17    17
18     1
19     1
dtype: int64

In [17]:
s.apply(lambda x: 100*x)

0    -2052.989816
1     1153.618595
2     1364.436199
3     -242.165020
4     2769.754624
5     -954.365675
6      545.758517
7      312.816150
8     2032.779214
9     1969.358770
10     654.947426
11     878.162520
12    -387.785748
13   -1480.796468
14     152.087851
15     656.348969
16    1730.290681
17    1702.379849
18     112.673183
19     197.697249
dtype: float64

In [18]:
s.apply(lambda y: abs(y))

0     20.529898
1     11.536186
2     13.644362
3      2.421650
4     27.697546
5      9.543657
6      5.457585
7      3.128161
8     20.327792
9     19.693588
10     6.549474
11     8.781625
12     3.877857
13    14.807965
14     1.520879
15     6.563490
16    17.302907
17    17.023798
18     1.126732
19     1.976972
dtype: float64

In [20]:
s_norm = s.apply(lambda x: (x - np.mean(s)) / np.std(s))
s_norm

0    -2.196241
1     0.503332
2     0.680815
3    -0.671747
4     1.863921
5    -1.271333
6    -0.008412
7    -0.204521
8     1.243478
9     1.190086
10    0.083512
11    0.271432
12   -0.794342
13   -1.714524
14   -0.339835
15    0.084692
16    0.988820
17    0.965322
18   -0.373017
19   -0.301437
dtype: float64

In [21]:
sigmoid = s_norm.apply(lambda x: 1 / (1 + np.exp(-x)))
sigmoid

0     0.100089
1     0.623242
2     0.663921
3     0.338106
4     0.865753
5     0.219029
6     0.497897
7     0.449047
8     0.776169
9     0.766756
10    0.520866
11    0.567444
12    0.311237
13    0.152578
14    0.415850
15    0.521160
16    0.728855
17    0.724186
18    0.407812
19    0.425206
dtype: float64

In [22]:
def more_complex(x):
  import math
  return math.sqrt(np.exp(x))
  s.apply(more_complex)